# SetEditInteger

## Description
Sets the numeric value of the specified INTEGER numeric edit field control.

```pascal
PROCEDURE SetEditInteger(
				dialogID : LONGINT;
				itemID   : LONGINT;
				value    : LONGINT);
```

```python
def vs.SetEditInteger(dialogID, itemID, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog layout containing the control.|
|itemID|LONGINT|The index of the control item.|
|value|LONGINT|The new value for the field.|

## Version
Availability: from VectorWorks9.0

## Category
* Dialogs - Modern